uhnp/src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаПредставления</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроводки</name>
    <type>
      <types>CatalogRef.ШаблоныПроводокДляМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроводки</name>
    <type>
      <types>EnumRef.ТипыПроводокМеждународныйУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеСчетаДт</name>
    <type>
      <types>CatalogRef.СоответствияСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеСчетаКт</name>
    <type>
      <types>CatalogRef.СоответствияСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеОборотов</name>
    <type>
      <types>CatalogRef.СоответствияОборотовМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/InformationRegisters/ПланыСчетовМеждународногоУчетаОрганизаций/ПланыСчетовМеждународногоУчетаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланыСчетовМеждународногоУчетаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НастройкаФормированияПроводок</name>
    <type>
      <types>CatalogRef.НастройкиФормированияПроводокМеждународногоУчета</types>
    </type>
  </resources>
  <dimensions>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыПроводокМеждународныйУчет/ТипыПроводокМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПроводокМеждународныйУчет</name>
  <enumValues>
    <name>Сторно</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Реверс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыАннулированияПроводокМеждународногоУчета/СпособыАннулированияПроводокМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыАннулированияПроводокМеждународногоУчета</name>
  <enumValues>
    <name>СторноПроводками</name>
    <comment>Проводками с отрицательной суммой и совпадающими счетами Дт и Кт</comment>
  </enumValues>
  <enumValues>
    <name>РеверсивнымиПроводками</name>
    <comment>Проводками с положительной суммой и переставленными счетами Дт и Кт</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/AccountingRegisters/Международный/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает сторнирующие проводки документа(ов).
//
// Параметры:
//  Регистраторы - ДокументСсылка - документы (массив документов) для которых необходимо получить сторнирующие проводки.
//  ПланСчетов - СправочникСсылка.ПланыСчетовМеждународногоУчета - План счетов, по которому надо получить таблицу сторно.
//  ПериодПланаСчетов - Дата - период обращения к настройке плана счетов организации, если не используется ПериодРегистратора
//  ПериодРегистратора - Булево - признак заполнения даты проводки датой сторнируемого документа если не указан, то дата
//                                не заполнена.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица проводок переданных регистраторов с обратным знаком сумм и типом проводки "Сторно" или "Реверс".
//
Функция ПроводкиСторно(Регистраторы, ПланСчетов, ПериодПланаСчетов, ПериодРегистратора = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроводокСторно();
	Запрос.УстановитьПараметр("СписокДокументов", Регистраторы);
	Запрос.УстановитьПараметр("Ссылка", Документы.ОперацияМеждународный.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ПериодРегистратора", ПериодРегистратора);
	Запрос.УстановитьПараметр("ПланСчетов", ПланСчетов);
	Запрос.УстановитьПараметр("ПериодПланаСчетов", ПериодПланаСчетов);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОписаниеПолей = ОписаниеПолейРегистра();
	ИнвертируемыеПоля = ИнвертируемыеПоля(ОписаниеПолей);
	ИнвертируемыеРесурсы = ИнвертируемыеРесурсы(ОписаниеПолей);
	
	Для Каждого Проводка Из Результат Цикл
		Если Проводка.ЗаменитьСторноРеверсом Тогда
			ИнвертироватьПроводку(Проводка, ИнвертируемыеПоля, ИнвертируемыеРесурсы, ОписаниеПолей.КоличествоСубконто);
			Проводка.ТипПроводки = Перечисления.ТипыПроводокМеждународныйУчет.Реверс;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеПолейРегистра() Экспорт
	
	МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	
	ОписаниеПолей = Новый Структура();
	ОписаниеПолей.Вставить("КоличествоСубконто",    МетаданныеРегистра.ПланСчетов.МаксКоличествоСубконто);
	ОписаниеПолей.Вставить("БалансовыеИзмерения",   Новый Массив());
	ОписаниеПолей.Вставить("НебалансовыеИзмерения", Новый Массив());
	ОписаниеПолей.Вставить("БалансовыеРесурсы",     Новый Массив());
	ОписаниеПолей.Вставить("НебалансовыеРесурсы",   Новый Массив());
	ОписаниеПолей.Вставить("Реквизиты",             Новый Массив());
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		ИмяИзмерения = Измерение.Имя;
		Если СтрНачинаетсяС(ИмяИзмерения, "Удалить") Тогда
		ИначеЕсли Измерение.Балансовый Тогда
			ОписаниеПолей.БалансовыеИзмерения.Добавить(ИмяИзмерения);
		Иначе
			ОписаниеПолей.НебалансовыеИзмерения.Добавить(ИмяИзмерения);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		ИмяРесурса = Ресурс.Имя;
		Если СтрНачинаетсяС(ИмяРесурса, "Удалить") Тогда
		ИначеЕсли Ресурс.Балансовый Тогда
			ОписаниеПолей.БалансовыеРесурсы.Добавить(ИмяРесурса);
		Иначе
			ОписаниеПолей.НебалансовыеРесурсы.Добавить(ИмяРесурса);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		ИмяРеквизита = Реквизит.Имя;
		Если СтрНачинаетсяС(ИмяРеквизита, "Удалить") Тогда
		ИначеЕсли ИмяРеквизита = "ИдентификаторФинЗаписи" Тогда
		Иначе
			ОписаниеПолей.Реквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеПолей;
	
КонецФункции

Функция ИнвертируемыеПоля(ОписаниеПолейРегистра) Экспорт
	
	ИнвертируемыеПоля = Новый Массив();
	ИнвертируемыеПоля.Добавить("Счет");
	ИнвертируемыеПоля.Добавить("Субконто");
	ИнвертируемыеПоля.Добавить("ВидСубконто");
	ИнвертируемыеПоля.Добавить("СоответствиеСчета");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИнвертируемыеПоля, ОписаниеПолейРегистра.НебалансовыеИзмерения);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИнвертируемыеПоля, ОписаниеПолейРегистра.НебалансовыеРесурсы);
	
	Возврат ИнвертируемыеПоля;
	
КонецФункции

Функция ИнвертируемыеРесурсы(ОписаниеПолейРегистра) Экспорт
	
	ИнвертируемыеРесурсы = ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеПолейРегистра.БалансовыеРесурсы);
	
	Для Каждого ИмяРесурса Из ОписаниеПолейРегистра.НебалансовыеРесурсы Цикл
		ИнвертируемыеРесурсы.Добавить(ИмяРесурса + "Дт");
		ИнвертируемыеРесурсы.Добавить(ИмяРесурса + "Кт");
	КонецЦикла;
	
	Возврат ИнвертируемыеРесурсы;
	
КонецФункции

Процедура ИнвертироватьПроводку(Проводка, ИнвертируемыеПоля, ИнвертируемыеРесурсы, КоличествоСубконто) Экспорт
	
	Для Каждого ИмяПоля Из ИнвертируемыеПоля Цикл
		Если ИмяПоля = "Субконто" ИЛИ ИмяПоля = "ВидСубконто" Тогда
			Для НомерСубконто = 1 По КоличествоСубконто Цикл
				ЗначениеПоляДт = Проводка[ИмяПоля + "Дт" + НомерСубконто];
				Проводка[ИмяПоля + "Дт" + НомерСубконто] = Проводка[ИмяПоля + "Кт" + НомерСубконто];
				Проводка[ИмяПоля + "Кт" + НомерСубконто] = ЗначениеПоляДт;
			КонецЦикла;
		Иначе
			ЗначениеПоляДт = Проводка[ИмяПоля + "Дт"];
			Проводка[ИмяПоля + "Дт"] = Проводка[ИмяПоля + "Кт"];
			Проводка[ИмяПоля + "Кт"] = ЗначениеПоляДт;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИмяРесурса Из ИнвертируемыеРесурсы Цикл
		Если ЗначениеЗаполнено(Проводка[ИмяРесурса]) Тогда
			Проводка[ИмяРесурса] = -Проводка[ИмяРесурса];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПроводокСторно()
	
	Возврат
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ПериодРегистратора
	|			ТОГДА Проводки.Период
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА &Ссылка = НЕОПРЕДЕЛЕНО
	|			ТОГДА Проводки.Регистратор
	|		ИНАЧЕ &Ссылка
	|	КОНЕЦ КАК Регистратор,
	|	Проводки.Организация,
	|	Проводки.СчетДт,
	|	Проводки.ПодразделениеДт,
	|	Проводки.НаправлениеДеятельностиДт,
	|	Проводки.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	|	Проводки.СубконтоДт1,
	|	Проводки.ВидСубконтоДт2 КАК ВидСубконтоДт2,
	|	Проводки.СубконтоДт2,
	|	Проводки.ВидСубконтоДт3 КАК ВидСубконтоДт3,
	|	Проводки.СубконтоДт3,
	|	Проводки.СчетКт,
	|	Проводки.ПодразделениеКт,
	|	Проводки.НаправлениеДеятельностиКт,
	|	Проводки.ВидСубконтоКт1 КАК ВидСубконтоКт1,
	|	Проводки.СубконтоКт1,
	|	Проводки.ВидСубконтоКт2 КАК ВидСубконтоКт2,
	|	Проводки.СубконтоКт2,
	|	Проводки.ВидСубконтоКт3 КАК ВидСубконтоКт3,
	|	Проводки.СубконтоКт3,
	|	Проводки.ВалютаДт,
	|	-Проводки.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	Проводки.ВалютаКт,
	|	-Проводки.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	-Проводки.КоличествоДт КАК КоличествоДт,
	|	-Проводки.КоличествоКт КАК КоличествоКт,
	|	-Проводки.Сумма КАК Сумма,
	|	-Проводки.СуммаПредставления КАК СуммаПредставления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПроводокМеждународныйУчет.Сторно) КАК ТипПроводки,
	|	Проводки.Содержание КАК Содержание,
	|	Проводки.СоответствиеСчетаДт КАК СоответствиеСчетаДт,
	|	Проводки.СоответствиеСчетаКт КАК СоответствиеСчетаКт,
	|	ВЫБОР
	|		КОГДА ПланыСчетовМеждународногоУчетаОрганизаций.НастройкаФормированияПроводок ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПланыСчетовМеждународногоУчетаОрганизаций.НастройкаФормированияПроводок.СпособАннулированияПроводок
	|			= ЗНАЧЕНИЕ(Перечисление.СпособыАннулированияПроводокМеждународногоУчета.РеверсивнымиПроводками)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаменитьСторноРеверсом
	|ИЗ
	|	РегистрБухгалтерии.Международный.ДвиженияССубконто(, , ПланСчетов = &ПланСчетов И Регистратор В (&СписокДокументов), , ) КАК Проводки
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПланыСчетовМеждународногоУчетаОрганизаций
	|		ПО Проводки.ПланСчетов = ПланыСчетовМеждународногоУчетаОрганизаций.ПланСчетов
	|		 И Проводки.Организация = ПланыСчетовМеждународногоУчетаОрганизаций.Организация
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ПланыСчетовМеждународногоУчетаОрганизаций.Период ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ПланыСчетовМеждународногоУчетаОрганизаций.Период В
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(ПланыСчетовОрганизаций.Период)
	|			ИЗ
	|				РегистрСведений.ПланыСчетовМеждународногоУчетаОрганизаций КАК ПланыСчетовОрганизаций
	|			ГДЕ
	|				ПланыСчетовОрганизаций.ПланСчетов = Проводки.ПланСчетов
	|				И ПланыСчетовОрганизаций.Организация = Проводки.Организация
	|				И ПланыСчетовОрганизаций.Период <= ВЫБОР
	|					КОГДА &ПериодРегистратора
	|						ТОГДА Проводки.Период
	|					ИНАЧЕ &ПериодПланаСчетов
	|				КОНЕЦ
	|			)
	|	КОНЕЦ
	|";
	
КонецФункции


#КонецОбласти


#КонецЕсли
